clc, clear all;

K = 1024;
N = 16 ;
fd = 16E3 ;
fs = 1.9313E3 ;
w1 = -2*pi*3E3/fd;
w2 = 2*pi*3E3/fd;

% Сигнал.
s = cos(2*pi*fs/fd*(0:N-1));

% Вычисление E0 с помощью интеграла (ага).
h = (w2-w1)/K;
w = w1:h:w2;
a = 0;
for k = 1:K
    t = sum(s.*exp(1i*w(k)*(0:N-1)));
    a = a + t*conj(t);
end
E0 = a*h;

W = sbmatrix(w1, w2, 0, N);
% Обнуление главной диагонали.
W0 = tril(W, -1) + triu(W, 1);
% Вычисление новых значений для главной диагонали.
k = (E0 - s*W0*s')/(s*eye(N)*s');
% Формирование субполосной матрицы с новой диагональю.
W = W0 + k*eye(N);
